// ==UserScript==
// @name         mod1
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==

(function() {
    'use strict';
    // Перший масив з фразами для пошуку
var targetPhrases = ["Дистанція та висота польоту коптера визначається:",
"Для безпеки польотів необхідно:",
"Для визначення прямокутних координат точки за допомогою листа військової топографічної карти треба:",
"З переліку оберіть координати точки в УСК 2000",
"З яких причин найчастіше псується обладнання під час роботи від генератора?",
"За умови вильоту на 7 км (при силі вітру 5-7 метрів на секунду) скільки є часу на Mavic 3 для розвідувальної роботи?",
"Завершувати політ потрібно при рівні заряду батареї:",
"Заряджати батарею можна:",
"Зони обмеження польотів (для коптерів у яких вони є):",
"На військових топографічних картах НЕ позначені",
"Основним недоліком супутникової (гугл) карти є",
'Польоти в режимі "Sport":',
'Режим керування "Mode 2" для правого стіку передбачає:',
"Рельєф на військових (і не тільки) топографічних картах передається",
"Що робити, коли борт переходить в режим auto-landing?",
"Яке співвідношення акумуляторів і флешок має бути у пілота?",
"Який генератор має безпечний струм з чистою синусоїдою?",
"Які обʼєкти, що можуть реально бути на місцевості, не видно (погано видно) на супутниковій карті (ОБЕРІТЬ ЗАЙВЕ)",
"Які прикладні методи перетворюють коливальну (пікову) напругу генератора на безпечний постійний струм?",
"Яку інформацію варто врахувати при першому вильоті?"
];

var highlightTexts = [
"Від точки зльоту",
"Піднятись вище перешкод",
"Скористатися інформацією внутрішньої рамки карти (виписати дві маленькі цифри, дві здорові цифри біля відповідного квадрату, визначити останні три цифри за допомогою вимірювання відстані від лінії сітки до точки)",
"x 4565787 y 3624761",
"Всі відповіді вірні",
"від 1 хв до 1 хв 20 сек",
"20-25%",
"Якщо вона не перегріта чи не переохолоджена",
"Можна розблокувати легальним шляхом, або пройти авторизацію",
"Військові частини та військові обєкти",
"Не відображає рельєф і висотні обєкти",
"Допомагають зменшити ризик втрати керування при сильних поривах вітру",
"Політ по прямій",
"Лініями та штрихами коричневого кольору.",
"намагатись підхопити сигнал від коптера ближче до землі, десь на висоті 50-60 м над землею, коли дія РЕБ буде слабкою",
"один акум - одна флешка",
"Інверторний генератор",
"Населені пункти",
"Всі відповіді вірні",
"перевірити силу вітру, погоду, продивитись візуальні орієнтири, РЕБ, робочу обстановку. Залишити 20-25% акумулятора для повернення"
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {

            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {

              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });
       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки

highlightTargetPhrases();

})();