// ==UserScript==
// @name         mod10
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==

(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"MilChat дозволяє завантажувати мапи в оффлайн:",
"OSM-карта передає місцевість у:",
"Граната типу ВОГ-17М призначена для …",
"За умови вильоту на 7 км (при силі вітру 5-7 метрів на секунду) скільки є часу на Mavic 3 для розвідувальної роботи?",
"Основна претензія до операторів БпЛА- це:",
"Перед вильотом обов’язково ...",
"По якій системі координат складані артилерійські таблиці?",
"При зльоті з піску чи землі:",
"Скид (система скидання) призначений для …",
"Суть корегування вогню артилерії за допомогою БпЛА полягає у …",
"У чому основна перевага та відмінність супутників StarLink від приладів попередніх поколінь?",
"У яких випадках слід негайно замінити ключі шифрування:",
"Чи має розвідник-корегувальник наносити на свою мапу (Кропива) цілі, розриви та іншу інформацію як під час тренувань, так і під час вогневого нальоту?",
"Що відбудеться, якщо на радіопередавач встановити антену невідповідної частоти:",
"Що має бути завжди з собою на фронті?",
"Що означає скорочення АФР?",
"Що означає той факт, що Ваша радіостанція підтримує цифровий режим роботи?",
"Що таке Грізельда?",
"Які умови ставляться перед оператором для успішного використання програми “На долоні”?",
"Які фактори негативно впливають на дальність радіозвʼязку з безпілотником:"
];

var highlightTexts = [
"Так",
"Умовних стандартизованих піктографічних знаках.",
"ураження живої сили противника та пошкодження автомобільної техніки.",
"від 1 хв до 1 хв 20 сек",
"низька оперативність обробки та доставки розшифрованої інформації до зацікавлених користувачів",
"Всі відповіді вірні",
"СК-42",
"Може пошкодитись камера чи мотори",
"монтажу та доставки боєприпасів з метою вогневого ураження.",
"визначення координат цілі та місця розриву снарядів",
"Вони знаходяться на орбіті значно нижчої висоти та здійснюють постійний злагоджений рух, який дозволяє їм покрити максимально велику територію",
"ключі скомпрометовані, втрачена радіостанція",
"так, навіть якщо є передача картинки онлайн.",
"Дальність зв\ʼязку значно зменшиться",
"Аптечка, заряджена зброя і пристрої, вода, ніж, саперна лопата, снікерс",
"Це скорочена назва «Активна фазована решітка», основний конструктивний елемент антени, що входить до складу терміналу StarLink",
"Радіостанція має функції цифрового зв’язку і при використанні спеціальної програми для налаштування можна підготувати радіостанцію до роботи по зашифрованим захищеним каналам.",
"Всі відповіді вірні",
"Обов’язково робити зйомку з максимально плавними рухами камери, аби алгоритм програми міг чітко розпізнати об’єкти на зображенні",
"Розташування антени наземної станції керування близько до поверхні Землі"
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {

       if (document.body.querySelector('.qtext').innerText === phrase) {

            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {
              if(elem.innerText.replace(/ʼ/g, '') === highlightText.replace(/ʼ/g, '')) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();


})();