// ==UserScript==
// @name         mod2
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==

(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"Виберіть правильну коректуру:",
"Висота автоматичного повернення дрона додому має бути …",
"Відповіді відображаються в задачі",
"Для чого корегувальнику варто розташовувати коптер за основним напрямком стрільби (дирекційним кутом)?",
"Для чого робити повторний аналіз відео?",
"Навіщо потрібно дотримуватися правила плавного руху дрона під час нічних польотів?",
"Під час зимових польотів садити дрон потрібно …",
"При взаємодії з напарником під час польоту необхідно …",
"При виборі позиції для польоту краще, щоб напрямок вітру …",
"При виконанні яких завдань можна використовувати дрони Autel?",
"При коригуванні вогню артилерії по сторонам світу, корегувальник вказує …",
"При якій мінімальній температурі повітря взимку потрібно тримати та заряджати акумулятори?",
"У команді на вогневу позицію окрім координат додатково доповідають …",
"Чим відрізняється ПЗ Autel Explorer від додатків DJI?",
"Чому корегувальнику варто знати, де знаходиться сонце протягом вильоту?",
"Чому можна не диктувати перші дві цифри координат Х та Y при коригуванні вогню?",
"Як називається «режим новачка» в програмному забезпеченні AutelSky?",
"Яка бажана мінімальна кількість людей задіяна для роботи з коптером?",
"Який обліковий запис використовується для входу в airdata (аналізу польотів)?",
"Які додаткові параметри має ПЗ Autel Explorer у порівнянні з AutelSky?"
];

var highlightTexts = [
"Північ 100 схід 150",
"нижче фактичної висоти роботи",
"Якщо вибух знаходиться +/- в 10 м від цілі",
"щоб легше було корегувати методом ліво-право, ближче-дальше (в метрах) для розрахунку артилеристів",
"Бо не всі цілі можуть бути виявлені у польоті",
"Чим плавніше рухається дрон, тим кращою буде картинка одразу та при аналізі відео.",
"Якщо заряду батареї залишилось ~ 40%",
"обмінюватись важливою оперативною інформацією",
"був на вас або з флангу у сторону наших позицій",
"Розвідка, супровід груп, корегування, оцінка своїх позицій, скиди",
"відхилення в напрямку сторони світу у метрах",
"14°",
"характер цілі, фронт та глибину цілі у метрах",
"Можливість ввімкнути чи вимкнути led індикатори, нижню підсвітку",
"щоб підходити до цілі зі сторони сонця задля маскування",
"ці цифри не змінюються (якщо точка не знаходиться на стику карт)",
"Novice mode",
"2",
"Обліковий запис девайсу, який використовується для польотів",
"Поглиблена конфігурація камери"
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {


              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();

})();