// ==UserScript==
// @name         mod3
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==

(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"Всенаправлена антена випромінює радіосигнал:",
"Де можна перевірити підозрілий файл одразу на багато антивірусів безкоштовно?",
"Канал передачі даних безпілотника призначений для:",
"Направлена антена має таку особливість:",
"Практикувати критичне мислення це",
"Система моніторингу Aeroscope має такі властивості:",
"У вас є смарт годинник який ви дуже любите, ви не знаєте як його перевести в режим польоту. Що краще зробити, коли ви йдете на бойове завдання на нуль?",
"Чи варто захищати телефон пін кодом або паролем?",
"Чи варто стирати інформацію з картки пам’яті перед кожним вильотом?",
"Що варто робити, коли отримали повідомлення в месенджері від начебто вашого командира, який просить вас відкрити прикріплений файл або посилання?",
"Який пароль із цих надійніший?",
"Якими російськими ресурсами можна користуватись?",
"Які заходи безпеки зменшують вразливість до застосування РЕБ:",
"Які ознаки застосування підміни сигналу супутникової навігації - “GPS spoofing”:",
"Які ознаки застосування придушення супутникової навігації - “GPS jamming”:",
"Які типи антен використовуються для пошуку спектральної активності?",
"Які фактори є демаскуючими для наземного пункту керування з точки зору радіотехнічної розвідки:",
"Які фактори негативно впливають на дальність радіозвʼязку з безпілотником:",
"Які фактори позитивно впливають на дальність радіозвʼязку з безпілотником:",
"Якою складовою безпілотного комплексу визначається частота радіосигналу керування дрона?"
];

var highlightTexts = [
"Однаково в будь-якому напрямку в площині, перпендикулярній осі антени",
"virustotal.com",
"Може виконувати усі перераховані функції",
"Випромінює сигнал в одному напрямку більшої потужності, ніж в інших",
"Те, що завжди треба робити",
"Визначає наявність та координати лише безпілотників виробництва DJI в зоні прийому сигналу від них",
"Я не впевнений як там відключається bluetooth, тому краще не буду брати і попрошу у когось механічний.",
"Так, обов’язково",
"Так, використовуючи програму вайпер (wiper)",
"Передзвонити і підтвердити голосом або відео, що це саме він надіслав і чому?",
"Y@umamikosmonavt1",
"Краще ніякими",
"Виконання польоту в ручному режимі з візуальною навігацією",
"Точка положення безпілотника на карті не відповідає командам керування та / або зміні на відеокартинці з дрону",
"Кількість активних супутників різко зменшується",
"Всі відповіді вірні",
"Розташування пункту керування на високій позиції на місцевості",
"Розташування антени наземної станції керування близько до поверхні Землі",
"Збільшення висоти польоту",
"Передавачем сигналу"
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {


              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();

})();