// ==UserScript==
// @name         mod4
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==


(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"Виконувати зліт з металевої поверхні …",
"Де на планшеті ПЗ Армор показані додані цілі?",
'Для чого призначений розділ “Чати” в MilChat?',
"За яким принципом можна називати цілі в ПЗ Армор?",
'Наскільки швидко програма “На долоні” спроможна проаналізувати матеріал?',
"Силу та напрям вітру краще визначати …",
"У Дельті шари бувають наступних видів:",
"Чи можна здійснювати дешифрування відео з БпЛА безпосередньо в Дельті?",
'Чи можна редагувати об\'єкт на карті після нанесення у платформі “Дельта”?',
"Чим більший кут спостереження до горизонту під час авіарозвідки …",
"Що саме система “На долоні” дозволяє отримати в результаті роботи?",
"Що таке Delta?",
"Що таке Тенета?",
"Що треба пам’ятати про пароль для використання комплексу Кропива?",
"Як максимально швидко видалити дані програми MilChat при потребі?",
'Як можна виділити групу об\'єктів на мапі у платформі “Дельта”?',
"Яка основна мета програми FireFly?",
"Яке обладнання потрібно для роботи додатка “На долоні”?",
'Який термін актуальності для нестаціонарних об\'єктів на шарах у платформі “Дельта”?',
'Які умови ставляться перед оператором для успішного використання програми “На долоні”?'
];

var highlightTexts = [
"не можна, через можливий збій компасу",
"У верхній частині екрана планшета",
"Список для перегляду індивідуальних і групових чатів, що використовуються для комунікації лише всередині застосунку MilChat",
"Згідно з назвами, які використовує артилерія",
"Відео тривалістю 3 години може бути оброблено за 20 хвилин",
"по показниках гіроскопу в програмі",
"глобальні, створені мною та відкриті для мене",
'так, через інструмент "дешифрування"',
"так, якщо ви маєте права на редагування або адміністрування",
"тим точніше можна виконати прицілювання",
"Підсвічує визначену ворожу техніку разом з позначкою часу (таймлайном), прикріпленим внизу відео",
"платформа забезпечення ситуаційної обізнаності всього сектору безпеки та оборони",
"Чат для обміну даними (в тому числі щодо коригування артилерійського вогню)",
"Після авторизації програми мене запитають про створення паролю. Якщо я забуду пароль, то відновити його не вдасться",
"Використати спеціальний пункт меню для екстреного видалення персональних даних з пристрою",
'скористатись інструментом "множинне виділення"',
"Додаткова програма, що дозволяє визначати координати точки, куди напрямлений центр камери квадрокоптера",
"Це програма для встановлення лише на персональному комп'ютері",
"5 діб",
"Обов’язково робити зйомку з максимально плавними рухами камери, аби алгоритм програми міг чітко розпізнати об’єкти на зображенні"
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {

              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();


})();