// ==UserScript==
// @name         mod5
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==


(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
'В чому скиди для квадрокоптерів типу DJI Mavic II, DJI Mavic III, Autel EVO II мають відмінності?',
'Граната типу ВОГ-17М призначена для …',
'Для перевірки фіксації системи скиду, необхідно:',
'До основних складових компонентів скиду можна віднести наступні:',
'До переобладнання гранат типу ВОГ-17М та експлуатації скидів допускаються:',
'Зазначте правильну послідовність дій, яку необхідно виконати для перевірки працездатності скиду:',
'Запобіжна чека на ударному механізмі переобладнаного боєприпасу типу ВОГ-17М демонтується …',
'Коли доречно використовувати комулятиви для скидання з коптерів?',
'Надир це – ….',
'Оптимальна точка прицілювання на танку для кумулятивного заряда з коптера',
'Скид (система скидання) призначений для …',
'Скид, що не має жодної цифри на корпусі, призначений для квадрокоптеру типу …',
'Склад екіпажу ударного дрону:',
'У яких випадках до виконання ударних місій допускається екіпаж без інженера-сапера?',
'Хто має взводити детонатор на боєприпасі з модифікованого пострілу ВОГ-17?',
'Яка найпоширеніша проблема, від якої не спрацьовує (25-30%) скид-постріл від РПГ-7',
'Який електронний елемент ініціює процес скидання гранати типу ВОГ-17 та виступає в якості тригеру?',
'Який коптер може нести скид-постріл ВОГ-17?',
'Який необхідний досвід для виконання ударних місій військовослужбовцями:',
'Який радіус ураження протипіхотного скиду-пострілу ВОГ-17?'
];

var highlightTexts = [
'Відмінності елементів кріплення корпусів скидів до квадрокоптерів.',
'ураження живої сили противника та пошкодження автомобільної техніки.',
'вставити боєприпас в скобу, закрити чеку, легенько потрясти систему скиду з зафіксованим у ній боєприпасом',
'Корпус скиду з елементами кріплення, електронне устаткування, елементи фіксації гранати ВОГ-17М.',
'Особи, які мають інженерно-саперну підготовку або досвід поводження з даними боєприпасами.',
'Увімкнути живлення скиду, почекати декілька секунд, увімкнути джерело світла, переконатися у відпиранні скоби фіксації гранати, вимкнути джерело світла, переконатися у фіксації скоби гранати, вимкнути живлення скиду.',
'безпосередньо перед бойовим зльотом.',
'для ураження танкової броні, складів БК, засоби РЕБ \\ РЕР',
'направлення камери, перпендикулярно вниз до уявної поздовжньої прямої лінії, що проходить через середину квадрокоптеру.',
'моторне відділення, адже воно не захищене динамічним захистом',
'монтажу та доставки боєприпасів з метою вогневого ураження.',
'Autel EVO II.',
'пілот, корегувальник, сапер',
'у жодному разі не дозволяється виконання ударних місій, якщо у складі екіпажу немає особи з інженерно-саперною освітою',
'сапер',
'потрапляння на похилу поверхню броні, коли не спрацьовує п\'єзоелектричний підривник',
'Фоторезистор.',
'Mavic 2, Mavic 3, Autel',
'обовязково необхідно мати: польотний досвід, бойовий досвід, психологічний досвід',
'8 метрів'
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {

              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();


})();