// ==UserScript==
// @name         mod6
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==


(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"З якими циклами взаємодіє цикл сенсорно-інформаційного забезпечення?",
"Категорії розвідників для артилерії:",
"Мережецентричний спосіб ведення бойових дій передбачає, що …",
"Основна претензія до операторів БпЛА- це:",
"Основні практичні задачі оператора БПЛА:",
"Проблеми у взаємодії між розвідниками та артилеристами можуть виникати через:",
"Ситуаційна обізнаність - це …",
"Формати комунікації з підрозділами артилерії бувають:",
"Чи має розвідник-корегувальник наносити на свою мапу (Кропива) цілі, розриви та іншу інформацію як під час тренувань, так і під час вогневого нальоту?",
"Чому важливо вимірювати час на кожну дію розрахунку БПЛА під час тренувань?",
"Чому важливо перейти до нових концепцій ведення війни?",
"Чому необхідно узгоджувати час виходу на вогневі позиції (ВП) підрозділам артилерії та розвідникам-корегувальникам?",
"Що вибрати між швидкістю та якістю обробки даних з БпЛА?",
"Що повинен розуміти розвідник-корегувальник артилерийського вогню перед виконанням завдання:",
"Що рекомендується робити (в тому числі) під час ведення вогневого нальоту:",
"Що таке процес ISTAR?",
"Як взаємодіє екіпаж БпАК з центрами сенсорно- інформаційного забезпечення? Оберіть НЕПРАВИЛЬНЕ твердження.",
"Яке головне правило під час комунікації в ході вогневого нальоту?",
"Яким чином краще підтвердити результати роботи артилерії:",
"Які є підходи до спостереження за цілями під час вогневого нальоту?"
];

var highlightTexts = [
"Аналітика, вогневе ураження",
"розвіники у складі власних підрозділів та залучені зі сторони;",
"кожен на полі бою - це інтелектуальна одиниця, що спроможна робити те, для чого вона призначена, та взаємодіяти з іншими підрозділами для більш оперативного планування та виконання бойової роботи",
"низька оперативність обробки та доставки розшифрованої інформації до зацікавлених користувачів",
"reconnaissance (розвідка/рекогностування), Target Acquisition (корегування вогню)",
"завищені очікування артилеристів до розвідників та/або технічних засобів розвідки.",
"сприйняття елементів і подій навколишнього середовища щодо часу або простору, розуміння їх значення та прогнозування їхнього майбутнього статусу",
"вертикальні (через старшого начальника) та горизонтальні (напряму)",
"так, навіть якщо є передача картинки онлайн.",
"старший начальник має закріпити цей час у відповідних керівних документах для того щоб давати вам вказівку коли розгортатись і згортатись під час роботи.",
"Це допоможе ефективніше планувати операції, знищувати більше ворогів та мінімізувати втрати серед особового складу та техніки",
"синхронність виходу на ВП дасть змогу швидко та ефективно відпрацювати ціль і не затримуватись на ВП занадто довго обом розрахункам.",
"швидкість",
"засоби нанесення вогневого ураження та їх кількість, темп стрільби, плановий час вогневого нальоту, кількість цілей до ураження і їх розташування;",
"постійно комунікувати (з певним проміжком часу) щодо залишку часу на ведення спостереження.",
"Intelligence – Розвідка (аналітика), Surveillance – Спостереження, Target Acquisition - Цілевказання та Reconnaissance – Рекогностування",
"Екіпаж БпАК не взаємодіє з центрами СІЗ, оскільки інформацію, отриману у результаті виконання завдань повітряної розвідки, можна розповсюджувати тільки у рамках власного підрозділу.",
"комунікувати чітко і конкретно корисну для артилеристів інформацію.",
"словесно, надати фото/відео",
"передача інформації щодо ураження цілей розвідниками самостійно або за допомогою спеціального програмного забезпечення онлайн."
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {

              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();


})();