// ==UserScript==
// @name         mod7
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==


(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"Де, на думку практикуючих пілотів, варто облаштовувати свої позиції?",
"Для чого знати карту своєї місцевості на память?",
"Навіщо користуватись Анонімайзером з дронами DJI?",
"Найкращий друг пілота БпЛА - це …",
"Перед вильотом обов’язково ...",
"Скільки має бути карток пам'яті перед вильотом?",
"У чому небезпека скидів з Matrice:",
"Хто має вас прикривати під час польотного завдання?",
"Чому важливо стерти всю чутливу інформацію зі своїх пристроїв?",
"Чому не можна користуватись Телеграмом, вайбером на іншими російськими розробками?",
"Чому розвідники не викладають про себе публічно інформацію?",
"Що має бути завжди з собою на фронті?",
"Як правильно вибирати позиції для стаціонарного літання?",
"Як точно зробити так, щоб російські окупанти вас помітили?",
"Який рекомендований проміжок часу роботи для оператора БпЛА?",
"Які є варіанти пониження прошивки дронів DJI:",
"Які основні засоби безпеки потрібно пам’ятати та виконувати перед польотами?",
"Які пристрої підсвічують вас на картах ворога?",
"Які ризики використання трофейних дронів:",
"Якщо виникла необхідість зупинити дрон в польоті, де це можна зробити найбільш безпечно?"
];

var highlightTexts = [
"Всі відповіді вірні",
"Для того щоб успішно виконувати завдання та чітко орієнтувати арту",
"Бо хитрі китайці продали русні Аероскопи, і тепер всі польоти дронів DJI видно",
"Лопата",
"Всі відповіді вірні",
"Стільки ж, скільки акумів. Якщо немає можливість злити інфо з вильоту на комп’ютер, треба на кожен виліт поставити нову карту",
"розмір дрону та гучність при роботі. Наприклад, M300 видно та чутно на 400 метрах, тоді як для влучання у ціль необхідно знизитись приблизно до 100 метрів. На такій висоті влучання ворогом у дрон є практично гарантованим",
"Хоча б 2-3 бійців",
"Щоб у випадку втрати пристрою або полону інформація не дісталась ворогу",
"Обидва варіанти правильні",
"Розвідник, який говорить що він/вона розвідник - це вже не розвідник",
"Аптечка, заряджена зброя і пристрої, вода, ніж, саперна лопата, снікерс",
"Всі відповіді вірні",
"Все описане вище",
"До 5 год",
"через сайт drone-hacks, якщо в переліку доступних версій є необхідна",
"Всі відповіді вірні",
"Всі увімкненні електронні пристрої",
"власник аккаунту, до якого прив'язаний дрон, має можливість переглядати у своєму особистому кабінеті всю інформацію про політ, включно з треком польоту",
"якщо дійсно потрібно, це можна зробити на якійсь відкритій місцевості, типу поле чи луг. У жодному разі не зупинятися над посадками, населеними пунктами тощо, так як високий ризик, що дрон зіб’ють.",
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {

              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();


})();