// ==UserScript==
// @name         mod8
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==


(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"В чому найсуттєвіша відмінність між аналоговим та цифровим режимами роботи?",
"Використання різних ключів на різних каналах здійснюється для:",
"Для чого існує різниця між короткостроковим натисканням на функціональні кнопки Motorola і довготривалим натисканням на ці кнопки?",
"З якою періодичністю бажано міняти ключі шифрування:",
"За правилами радіообміну, встановлення звязку відбувається за фомою:",
"За правилами радіообміну, передача повідомлень здійснюється:",
"За правилами радіообміну, позивний абонента:",
"За правилами радіообміну, якого розміру повідомлення мають бути:",
"За правилами радіообміну, якщо необхідно передати інформацію, але ви розумієте, що канал зайнятий іншими абонентами мережі, ви:",
"Налаштування радіостанцій Motorola, такі як створення та призначення на канлаи ключів шифрування, ключів та паролів ретранслятора, здійснюється шляхом:",
"У яких випадках слід негайно замінити ключі шифрування:",
"Чи є можливість автоматично сформувати інструкцію з експлуатації для користувача радіостанції Motorola, після її програмування та налаштування необхідних параметрів:",
"Чи може робити налаштування радіостанції сам користувач радіостанції?",
"Чи можуть радіостанції різних виробників працювати одна з одною для передачі та прийому сигналів?",
"Що можна налаштувати для радіостанцій Motorola у розділі «Системи сигналінгу» програми налаштування радіостанцій MOTOTRBO?",
"Що означає той факт, що Ваша радіостанція підтримує цифровий режим роботи?",
"Що таке вихідна потужність радіостанції?",
"Як користувач радіостанції може зрозуміти, які функції в його радіостанції доступні і якими кнопками можна їх включити?",
"Які варіанти цифрового виклику можна налаштувати на радіостанціях Motorola?",
"Які два діапазони частот доступні для передачі та прийому сигналів на більшості радіостанцій?"
];

var highlightTexts = [
"Цифровий режим дозволяє налаштувати шифрований зв’язок між радіостанціями",
"забезпечення безпеки зв'язку, наприклад - для оперативної зміни каналу зв'язку з новим ключем, у разі розшифрування першого каналу ворогом",
"Для того, щоб налаштувати різні функції і режими роботи радіостанції на невеликій кількості наявних функціональних кнопок",
"ключі повинні періодично мінятися, бажано щомісяця",
"виклик абонента, відповідь на виклик, передача повідомлення після встановлення звязку, відповідь на повідомлення, при потребі - підтвердження розуміння шляхом дублювання в ефір",
"неквапливо, чітким голосом і максимально лаконічно",
"має складатися з двох частин: слова та цифрового коду",
"максимально лаконічні, чіткі, з використанням раніше узгоджених шифрів",
"втручатися в радіообмін між двома радіостанціями заборонено",
'налаштування відповідних параметрів через MOTOTRBO CPS (розділ “Захист”)',
"ключі скомпрометовані, втрачена радіостанція",
"так, для автоматичного формування необхідно натиснути: Звіти - Розширені клієнтські матеріали",
"Ні, усі налаштування радіостанцій робляться за допомогою спеціалізованої програми на ПК. Користувач лише може використовувати ті режими і команди, що запрограмовані",
"Все залежить від налаштувань роботи радіостанції. В аналоговому режимі будь-хто зможе почути прийом / передачу сигналів, а в цифровому потрібно дуже ретельно робити налаштування, є можливість навіть налаштувати роботу в цифровому режимі радіостанцій Motorola та Hytera",
"Налаштувати можливість віддаленого прослуховування оперативної обстановки навколо радіостанцій, можливість віддаленого відключення радіостанцій, налаштування передачі екстрених сигналів при натисканні екстреної кнопки",
"Радіостанція має функції цифрового зв’язку і при використанні спеціальної програми для налаштування можна підготувати радіостанцію до роботи по зашифрованим захищеним каналам",
"Це потужність вбудованого передавача. Зміна потужності потрібна здебільшого для зменшення радіусу передачі сигналу чи для економного витрачання заряду акумулятора.",
"В програмі налаштування радіостанцій MOTOTRBO є можливість автоматичної підготовки розширеної інструкції, де будуть описані усі особливості налаштування кожної окремої радіостанції. Ця інструкція може бути передана користувачу радіостанції для полегшення ознайомлення з особливостями виконаних налаштувань",
"Індивідуальні, групові і загальні виклики (циркулярні)",
"VHF діапазон та UHF діапазон"
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {

              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();


})();