// ==UserScript==
// @name         mod9
// @namespace    http://tampermonkey.net/
// @version      2024-03-28
// @description  try to take over the world!
// @author       You
// @match        https://dln.viti.edu.ua/mod/quiz/attempt.php*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tampermonkey.net
// @grant        none
// ==/UserScript==

(function() {
    'use strict';

    // Your code here...
    // Перший масив з фразами для пошуку
var targetPhrases = [
"Виберіть із запропонованих найкраще місце розташування терміналу на землі",
"Встановлення терміналу StarLink — важливий фактор його ефективною роботи. Укажіть хибне твердження:",
"Навіщо потрібен зв’язок StarLink?",
"Найбільш ефективне візуальне маскування терміналу StarLink передбачає:",
"Наскільки швидким може бути зв'язок через термінал StarLink?",
"Розрахуйте приблизно необхідну ширину каналу для трансляції, що передбачає використання: камери БПЛА з роздільною здатністю на 4к, камери тепловізора з роздільною здатністю HD та польотної камери з роздільною здатністю HD + передача телеметрії та метаданих",
"Роутери StarLink мають достатньо обмежені можливості керування. Які з наведених нижче функцій роутерів доступні тільки для авторизованих користувачів?",
"У певних випадках мобільні інвертори можуть призводити до негативних наслідків у роботі терміналів Starlink та суміжного обладнання. Позначення правильне твердження:",
"У чому основна перевага та відмінність супутників StarLink від приладів попередніх поколінь?",
"Чи є відмінність між різними терміналами StarLink?",
"Чим відрізняються роутери першого покоління терміналів StarLink V1 від другого та третього?",
"Чому важливо час від часу включати термінал, навіть якщо цей зв’язок не потрібен в роботі?",
"Чому для терміналу StarLink настільки важливо забезпечення стабільного якісного живлення?",
"Чому засоби РЕБ можуть бути шкідливими для роботи терміналу StarLink?",
"Що НЕ входить в комплектацію терміналу StarLink версії V2:",
"Що означає скорочення АФР?",
"Що означає словосполучення «паркування АФР»",
"Що треба знати про оригінальну картонну коробку від терміналу StarLink?",
"Які обов'язкові умови встановлення терміналу StarLink?",
"Які основні принципи збереження радіо гігієни?"
];

var highlightTexts = [
"В заглибленні у землі для захисту від шрапнелі, куль, вибухів, з додатковим захистом від потрапляння в яму людей чи тварин, з захистом від затоплення, плюс маскування у вигляді каптура / маскувальної сітки",
"Старлінк не можна встановлювати абсолютно вертикально",
"Бо це новітній підхід до організації доступу до інтернет шляхом підключення через супутники, що дозволяє мати зв'язок далеко від цивільної інфраструктури",
"Використання радіопрозорих маскувальних матеріалів",
"Швидкість на читання до 300Мбіт/сек, на відправку даних 25Мбіт/сек",
"16.5 Мб",
"Можливість перемикати між WPA2 та WPA3",
"Неякісні інвертори здатні створювати перешкоди для роботи радіостанцій поблизу",
"Вони знаходяться на орбіті значно нижчої висоти та здійснюють постійний злагоджений рух, який дозволяє їм покрити максимально велику територію",
"Вони відрізняються формою терміналу (квадратний чи круглий), але більш важливими відмінностями є кількість споживання енергії та відмінність підключення терміналу до WiFi роутера",
"У наступних поколінь роутерів використані кастомізовані роз'єми, що вимагають застосування спеціальних адаптерів",
"Виробник постійно виконує оновлення програмного забезпечення терміналу (випуск нової прошивки). Якщо прошивка відстає на два або три місяці – термінал може не підключатися до зв’язку і вирішити це питання можна буде лише після звернення до технічної підтримки",
"Дешеві інвертори живлення часто не відповідають вимогам живлення терміналів Starlink по максимальній потужності або створюють апроксимовану синусоіду, що призводить до пошкодження блоків живлення",
"Тому що в роботі терміналу використовуються також інформація про геопозицію терміналу, саме з цих причин може суттєво погіршитися швидкість роботи по каналам зв’язку або довго тривати процес початкового запуску терміналу в роботу",
"Окремий основний блок живлення",
"Це скорочена назва «Активна фазована решітка», основний конструктивний елемент антени, що входить до складу терміналу StarLink",
"Переведення терміналу до стану транспортування, що виконується перед виключенням шляхом спеціальних команд в додатку керування або шляхом перевертання терміналу догори кріпленням",
"Ця коробка легко псується, тому обов'язково треба знайти їй заміну у вигляді транспортного боксу, але обов'язково переписати / сфотографувати / вирізати і зберегти ідентифікатор Вашого комплекту терміналу (KIT ID)",
"Розмістити таким чином, щоб забезпечити чистий доступ до небокраю без перешкод, бажано мати вільний огляд відкритого неба конусом не менше 140 градусів",
"Найбільш небезпечним елементом з точки зору радіо гігієни є WiFi роутер, тому основні сили мають бути спрямовані на обмеження випромінювання 2.4 / 5.8 ГГц від цього обладнання"
];


function highlightTargetPhrases() {
    var pageText = document.body.innerText;

    targetPhrases.forEach(function(phrase, index) {
       if (document.body.querySelector('.qtext').innerText === phrase) {


            var highlightText = highlightTexts[index] || '';
            document.body.querySelectorAll('.flex-fill').forEach(function(elem) {

              if(elem.innerText.replace(/ʼ/g, '') === highlightText) {
                elem.style.backgroundColor = 'yellow';
                var ide = elem.parentElement.id.replace(/_label/g, '')
                document.getElementById(ide).click();
              }
            });

       }
    });

    //document.body.innerHTML = pageText;
}

// Виклик функції для виділення фраз при завантаженні сторінки
highlightTargetPhrases();


})();